; domain
;; domain.pddl
;; Domain: Tabletop manipulation - unstacking a nested item and setting it on a table
;; Reusable for any task where a small item is nested inside a container item,
;; and both must end up placed at designated table locations, item-first then container.

(define (domain table-setting)

  (:requirements :strips :typing)

  (:types
    item      ; movable objects, e.g. mug, bowl
    location  ; symbolic places: drawer/basket location, table target locations
  )

  (:predicates
    (robot-at ?l - location)          ; robot's current symbolic location
    (item-at ?i - item ?l - location) ; item is resting at a free-standing location
    (inside ?i - item ?c - item)      ; item ?i is nested inside container item ?c
    (holding ?i - item)               ; gripper is currently holding item ?i
    (gripper-empty)                   ; gripper holds nothing
  )

  ;; ---------------------------------------------------------------
  ;; Move the robot base/arm symbolically between locations
  ;; ---------------------------------------------------------------
  (:action move
    :parameters (?from - location ?to - location)
    :precondition (and (robot-at ?from))
    :effect (and (not (robot-at ?from))
                 (robot-at ?to))
  )

  ;; ---------------------------------------------------------------
  ;; Remove an item that is nested inside a container item.
  ;; Represents extraction (e.g., lifting the mug out of the bowl).
  ;; ---------------------------------------------------------------
  (:action remove
    :parameters (?i - item ?c - item ?l - location)
    :precondition (and (robot-at ?l)
                        (inside ?i ?c)
                        (item-at ?c ?l)
                        (gripper-empty))
    :effect (and (holding ?i)
                 (not (inside ?i ?c))
                 (not (gripper-empty)))
  )

  ;; ---------------------------------------------------------------
  ;; Grasp an item that is free-standing (not nested) at a location.
  ;; ---------------------------------------------------------------
  (:action grasp
    :parameters (?i - item ?l - location)
    :precondition (and (robot-at ?l)
                        (item-at ?i ?l)
                        (gripper-empty))
    :effect (and (holding ?i)
                 (not (item-at ?i ?l))
                 (not (gripper-empty)))
  )

  ;; ---------------------------------------------------------------
  ;; Place a held item down at the robot's current location and
  ;; open the gripper (release is folded into place's effects).
  ;; ---------------------------------------------------------------
  (:action place
    :parameters (?i - item ?l - location)
    :precondition (and (robot-at ?l)
                        (holding ?i))
    :effect (and (item-at ?i ?l)
                 (not (holding ?i))
                 (gripper-empty))
  )

)

; problem
;; problem.pddl
;; Scene: mug nested inside bowl, both in an open wire basket ("drawer") on the table.
;; Goal: mug placed at its designated table spot, bowl placed beside it,
;;       gripper ends empty.

(define (problem table-setting-mug-bowl)
  (:domain table-setting)

  (:objects
    mug bowl - item
    drawer_loc mug_target_loc bowl_target_loc - location
  )

  (:init
    (robot-at drawer_loc)
    (item-at bowl drawer_loc)
    (inside mug bowl)
    (gripper-empty)
  )

  (:goal
    (and
      (item-at mug mug_target_loc)
      (item-at bowl bowl_target_loc)
      (gripper-empty)
    )
  )
)

; plan
1. (remove mug bowl drawer_loc)
   deleted: (inside mug bowl) (gripper-empty)
   added: (holding mug)
   goals met: 0 of 3
2. (move drawer_loc mug_target_loc)
   deleted: (robot-at drawer_loc)
   added: (robot-at mug_target_loc)
   goals met: 0 of 3
3. (place mug mug_target_loc)
   deleted: (holding mug)
   added: (item-at mug mug_target_loc) (gripper-empty)
   goals met: 2 of 3
4. (move mug_target_loc drawer_loc)
   deleted: (robot-at mug_target_loc)
   added: (robot-at drawer_loc)
   goals met: 2 of 3
5. (grasp bowl drawer_loc)
   deleted: (item-at bowl drawer_loc) (gripper-empty)
   added: (holding bowl)
   goals met: 1 of 3
6. (move drawer_loc bowl_target_loc)
   deleted: (robot-at drawer_loc)
   added: (robot-at bowl_target_loc)
   goals met: 1 of 3
7. (place bowl bowl_target_loc)
   deleted: (holding bowl)
   added: (item-at bowl bowl_target_loc) (gripper-empty)
   goals met: 3 of 3
